      ******************************************************************
      * Author:Carlos Eduardo
      * Date:25/07/2022
      * Purpose:estudar o comando COMPUTE
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ComputCommand.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 WS-RESULT            PIC 9(05) VALUE ZEROS.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.

            STOP RUN.
       END PROGRAM ComputCommand.
