      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. "Hello World".                                       nameprogram
       DATA DIVISION.                                                   acesso a programas e arquivos
       FILE SECTION.
       WORKING-STORAGE SECTION.                                         declaração das variaveis
       PROCEDURE DIVISION.                                              aonde ficará nosso script COBOL
       MAIN-PROCEDURE.
            DISPLAY "Hello World"
            STOP RUN.
       END PROGRAM "Hello World".
